NOTE:
-----

진행하기 전에 다음의 셀을 실행시키고 가자.

Please run the below cells first before proceeding- you'll need them soon!

In [3]:
%load_ext sql
%sql sqlite:///dataset_1.db

'Connected: @dataset_1.db'

활동 3b
------------
집계 연산자, GROUP BY

Aggregation operators, GROUP BY

문제 #1
-----------

베이글 스타트업 산업에 사용된 다음의 테이블들을 살펴보자. 먼저 두 개의 테이블을 먼저 살펴 볼 텐데, `bagel`은 베이글 회사가 생산하는 베이글의 종류를 나타낸다:

Consider a set of tables that describe the up-and-coming bagel startup industry; for now let's just look at two tables here, `bagel`, which describes types of bagels made by the different bagel companies:


> * name STRING
> * price FLOAT
> * made_by STRING

그리고 `purchase`:

And `purchase`:

> * bagel_name STRING
> * franchise STRING
> * date INT
> * quantity INT
> * purchaser_age INT

`purchase.bagel_name` 는  `bagel.name`을 참조하고 `purchase.franchise` 는 `bagel.made_by` 을 참조한다:

Where `purchase.bagel_name` references `bagel.name` and `purchase.franchise` references `bagel.made_by`:

In [2]:
%sql SELECT * FROM bagel LIMIT 3;

 * sqlite:///dataset_1.db
Done.

[('Plain with shmear', 1.99, 'Bobs Bagels'),
 ('Egg with shmear', 2.39, 'Bobs Bagels'),
 ('eBagel Drinkable Bagel', 27.99, 'eBagel')]

In [3]:
%sql SELECT * FROM purchase LIMIT 3;

 * sqlite:///dataset_1.db
Done.

[('Plain with shmear', 'Bobs Bagels', 1, 12, 28),
 ('Egg with shmear', 'Bobs Bagels', 2, 6, 47),
 ('Plain with shmear', 'BAGEL CORP', 2, 12, 24)]

**구매자의 평균 나이가 18세 이상인** 베이글의 종류에 대한 _총수입_을 계산하는 질의문을 작성해보자. 질의문을 아래에 작성해보자:

Can you write a query to get the _total revenue_ for each bagel type **which had an average purchaser age over 18**?  Type your query below:

In [ ]:
%%sql

In [7]:
"""
예상 되는 결과는 다음과 같다.

이 셀을 다시 실행하지 말자. 다시 실행하면 결과는 사라진다.
"""

"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///dataset_1.db
Done.

[('Egg with shmear', 14.34), ('Plain with shmear', 84.50999999999999)]

문제 #2
-----------

이번에는 간소화된 버전의 `precipitation_full` 테이블을 사용할 것이다. 스키마는 다음과 같고, _CA_ 지역의 하루 강우량만 기록하고 있다:

Here we'll use a simplified version of the `precipitation_full` table, which just has _daily_ rainfall _in CA only_, and has the following schema:


> * station_id
> * day
> * precipitation

In [4]:
%sql SELECT * FROM precipitation LIMIT 5;

 * sqlite:///dataset_1.db
Done.

[(16102, 1, 10),
 (16102, 4, 10),
 (16102, 24, 30),
 (21201, 1, 0),
 (21201, 20, 10)]

평균 침전물이 75 이상인 station_ids 를 구하려고 한다. 먼저, 중첩된 질의문으로 작성해보자:

We want to get station_ids which have average precipitations > 75.  Try doing this first as a nested query:

In [ ]:
%%sql

In [6]:
"""
예상 되는 결과는 다음과 같다.

이 셀을 다시 실행하지 말자. 다시 실행하면 결과는 사라진다.
"""

"""
Expected output below

Don't re-execute this cell!
"""

Done.

[(88302,), (250002,), (335701,), (357302,), (488301,)]

이 번에는 GROUP BY를 사용하여 작성해보자:

Now, try re-writing as a GROUP BY:

In [ ]:
%%sql

In [7]:
"""
예상 되는 결과는 다음과 같다.

이 셀을 다시 실행하지 말자. 다시 실행하면 결과는 사라진다.
"""

"""
Expected output below

Don't re-execute this cell!
"""

Done.

[(88302,), (250002,), (335701,), (357302,), (488301,)]

실행 결과 계산 시간을 `%time`으로 측정해보자. `%time` 명령 다음에 질의문을 한 줄로 표현하여 실행하여 보자. 갑갑해 보이지만, 그래도 동작한다. 그리고 실행 결과들을 비교해보자!

Now time it by using `%time` followed by single-line versions of your queries above (clunky, but will work) to see how they compare!


**Note:**   아래는 임의의 질의문의 측정 결과이다. 앞에서 작성을 아래 문장과 치환하여 성능을 비교해보자.

**Note:** Yes, currently the answers are filled in below for convenience... but you should still try getting them on your own above!

In [8]:
-- 중첩 질의문의 사용
%time %sql SELECT DISTINCT p.station_id FROM precipitation p ;

Done.
CPU times: user 41.9 ms, sys: 1.39 ms, total: 43.3 ms
Wall time: 42.5 ms

[(88302,), (250002,), (335701,), (357302,), (488301,)]

In [9]:
-- 집계 함수와 조건절 사용
%time %sql SELECT p.station_id FROM precipitation p ;

Done.
CPU times: user 3.06 ms, sys: 1.43 ms, total: 4.49 ms
Wall time: 3.11 ms

[(88302,), (250002,), (335701,), (357302,), (488301,)]

**몇 배 정도의 시간 차이가 있나?**

**An ~ 10-20x difference in execution time!!**